A = [0, 4, 1, 3, 1, 2, 4, 1]
B = [0] * len(A)   # 정렬 자료들 저장할 리스트  [0, 0, 0, 0, 0, 0, 0, 0]
K = max(A)     # K = 4
C = [0] * (K + 1)  # 최댓값 인덱스로 사용할 수 있어야 함

# 값의 개수 저장
for val in A:
    C[val] += 1   #  C = [1, 3, 1, 1, 2]

# 누적 빈도수 계산
for i in range(1, K + 1):  # i = 1, 2, 3
    C[i] += C[i-1]   # C = [1, 4, 5, 6, 8] [0, 3, 5, 6, 8]

val = 2
print(C[val] - 1)
B[C[val] - 1] = val
print(B)   # [1, 0, 0, 0, 0, 0, 0, 0] -> [0, 0, 0, 0, 2, 0, 0, 0]

val = 1, 2, 3, 4, 5
for val in range(1, len(C) + 1):  # val = 1, 2, 3, 4, 5
    B[C[val - 1]] = val
    C[val] -= 1



